src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Comment>Дополнительные характеристики номенклатуры</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.ТипыНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Comment>Дата изготовления серии номенклатуры</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Comment>Срок годности</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>Серийный номер номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Comment>Категория качества номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>Порядковый номер характеристики, по которому производиться сортировка элементов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСахара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Негоциант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Comment>Полный текст строкового дополнительного реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Справки2ЕГАИС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ОграниченияДанныхХарактеристики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ОграниченияДанныхХарактеристики</Name>
			<Comment>Ограничения данных характеристики</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Все</Name>
					<Comment>Все данные (не ограничивать)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сроки_Сертификаты</Name>
					<Comment>Сроки хранения и сертификаты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерийныйНомер_Свойства</Name>
					<Comment>Серийные номера и свойства характеристики</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свойства</Name>
					<Comment>Свойства характеристики</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Качество</Name>
					<Comment>Категории качества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркированнаяАП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Характеристики номенклатуры"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// получим ограничения
	Ограничение=НЕОПРЕДЕЛЕНО; ТипНоменклатуры=НЕОПРЕДЕЛЕНО;
	Если ТипЗнч(Объект.Владелец)=Тип("СправочникСсылка.Номенклатура") Тогда
		ТипНоменклатуры=Объект.Владелец.ТипНоменклатуры;
	ИначеЕсли ТипЗнч(Объект.Владелец)=Тип("СправочникСсылка.ТипыНоменклатуры") Тогда
		ТипНоменклатуры=Объект.Владелец;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
		Ограничение=ТипНоменклатуры.ОграничениеДанныхХарактеристик;
		Если ТипНоменклатуры.УникальностьСерийногоНомера Тогда
			УникальностьСерНомера=3;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ограничение) Тогда
		Ограничение=Перечисления.ОграниченияДанныхХарактеристики.Все;
	КонецЕсли;
	
	Если УникальностьСерНомера <> 3 И Ограничение=Перечисления.ОграниченияДанныхХарактеристики.СерийныйНомер_Свойства Тогда
		УникальностьСерНомера = 1;
	КонецЕсли;
	
	// в зависимости от вида ограничения расставляем обязательные реквизиты
	Если(Ограничение=Перечисления.ОграниченияДанныхХарактеристики.Все) Тогда
		Если ЗначениеЗаполнено(УникальностьСерНомера) Тогда 
			ОбязательныеРеквизиты.Добавить("СерийныйНомер");
		КонецЕсли;
	ИначеЕсли (Ограничение=Перечисления.ОграниченияДанныхХарактеристики.Качество) Тогда
		ОбязательныеРеквизиты.Добавить("Качество");
	ИначеЕсли (Ограничение=Перечисления.ОграниченияДанныхХарактеристики.СерийныйНомер_Свойства) Тогда
		ОбязательныеРеквизиты.Добавить("СерийныйНомер");
	ИначеЕсли (Ограничение=Перечисления.ОграниченияДанныхХарактеристики.Сроки_Сертификаты) Тогда
		ОбязательныеРеквизиты.Добавить("СрокГодности");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Процедура формирует наименование объекта.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Формируем наименование в зависимости от заполненных реквизитов.
	Наименование = "";
		
	// Серийный номер
	Если НЕ ПустаяСтрока(СокрЛП(Объект.СерийныйНомер)) Тогда
		Наименование = Наименование + " с/н " + СокрЛП(Объект.СерийныйНомер);
	КонецЕсли;
	
	// Качество
	Если ЗначениеЗаполнено(Объект.Качество) Тогда
		Наименование = Наименование + " " + СокрЛП(Объект.Качество);
	КонецЕсли;
	
	// Сертификат
	Если ЗначениеЗаполнено(Объект.Сертификат) Тогда
		Наименование = Наименование + " " + СокрЛП(Объект.Сертификат);
	ИначеЕсли НЕ ПараметрыДействия = Неопределено 
		И ТипЗнч(ПараметрыДействия) = Тип("Структура") 
		И ПараметрыДействия.Свойство("СертификатНаименование") 
		И НЕ ПараметрыДействия.СертификатНаименование = НСтр("ru = 'Сертификат  №  до'") + " " Тогда 
		Наименование = Наименование + " " + СокрЛП(ПараметрыДействия.СертификатНаименование);
	КонецЕсли;
	
	// Срок годности
	Если ЗначениеЗаполнено(Объект.СрокГодности) Тогда
		Наименование = Наименование + " " + НСтр("ru = 'годен до'") + " " + Формат(Объект.СрокГодности,"ДФ=dd.MM.yy");
	КонецЕсли;
	
	// Доп.пробел перед прочими свойствами.
	Если НЕ ПустаяСтрока(Объект.Наименование) Тогда
		Наименование = Наименование + " ";
	КонецЕсли;
	
	// Свойства
	Если НЕ ПараметрыДействия=Неопределено И ПараметрыДействия.Свойство("Форма") Тогда
		Если ПараметрыДействия.Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
			НомерСвойства = 0;
			Для Каждого ДополнительноеСвойство Из ПараметрыДействия.Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
				ЗначениеСвойства = ПараметрыДействия.Форма[ДополнительноеСвойство.ИмяРеквизитаЗначение];
				Если ЗначениеЗаполнено(ДополнительноеСвойство.ИмяРеквизитаЗначение) Тогда
					НаименованиеСвойства = ПараметрыДействия.Форма[ДополнительноеСвойство.ИмяРеквизитаЗначение];
				Иначе
					НаименованиеСвойства = Строка(ДополнительноеСвойство.Свойство);
				КонецЕсли;
			
				Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
					НомерСвойства = НомерСвойства + 1;
					Наименование = Наименование + ?(НомерСвойства = 1,"", ", ") + НаименованиеСвойства +": "+ ЗначениеСвойства;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Обрежем лишние пробелы
	Наименование = СокрЛП(Наименование);
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименованиеПоУмолчанию()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
